<template lang="pug">
include ../../assets/pugmix/mixin.pug
.conteiner.worksSmall.public_margin
    .worksSmall__header
        +CreateH("Тестовые задание",false,false)
    .worksSmall__content.public_margin 
        +CreatCard("@/static/image/tz4.png","HTML css js","тестовое задание одной компании","Описание: Верстка, тз одной из компаний. использовал чистый html - css - js, задача была сделать страницу по макету, и адаптировать под телефоны без макета ","Открыть <~>",false,"Cached >=", "https://xarn0.github.io/tz4/")
        +CreatCard("@/static/image/tz1.png","HTML SCSS Pug VUE VUEX VUE-router","Тестовое задание №1 ","Описание: В этом тестовом задание было реализовано следующие, панели связанные между собой, при нажатие на правую панель на любой цвет квадрата он удалиться, при нажатие кнопки сортировать, все квадратики перемешиваются, в левой панели можно добавить квадратики, можно изменить их цвет, можно их отключить(как строчку, так и весь блок с квадратами) ","Открыть <~>",false,"Cached >=", "https://xarn0.github.io/proContent/")
        +CreatCard("@/static/image/tz2.png","HTML SCSS Pug VUE VUEX VUE-router","Тестовое задание №2 ","Описание: Здесь реализовал подобие мини-игры, сделано вращение барабана, и выводит  комбинации(Их порядка 15-20), сделал подcветку комбинаций, когда у вас закончится монеты игра остановится, так-же можно менять ставку каждого круга 'снизу в левом углу'(Но у вас не получится изменить ставку если она больше количества ваших монет) ","Открыть <~>",false,"Cached >=", "https://xarn0.github.io/royal-mini-game/")  
        +CreatCard("@/static/image/tz3.png","HTML scss vue","тестовое задание одной компании","Описание: Верстка, тз одной из компаний. использовал vue,  нужно было сделать по макету, при условие если блоков меньше 8, то отрисовывалось в две строчки, если блоков меньше 5 то в одну строчку, если болоков больше 8- в одну строчку скролл ","Открыть <~>",false,"Cached >=", "https://xarn0.github.io/rlt-tz/") 
        +CreatCard("@/static/image/tz6.png","HTML scss vue  typescript","тестовое задание одной компании","Описание: Верстка, тз одной из компаний. использовал vue, typescript, нужно было сделать по макету, не используя никаких ui-библиотек ","Открыть <~>",false,"Cached >=", "https://xarn0.github.io/rlt-tz/") 
        +CreatCard("@/static/image/tz5.png","HTML css js","тестовое задание одной компании","Описание: Верстка, тз одной из компаний. использовал чистый html - css - js, здесь предоставляли три сайта на выбор, чтобы сделать такой же дизайн как у них, в задании было нужно реализовать следующие: 1 картинка 1 параграф 1 заголовок и сделать сементику страницы  ","Открыть <~>",false,"Cached >=", "https://xarn0.github.io/in-tz/") 
        +CreatCard("@/static/image/tz8.png","HTML css js","Создание playable-ads","Описание: Реализовать интерактивный Playable Ads, где игроку нужно выбрать одну из трех закрытых карточек, за которой скрыт приз. Карточки перемешиваются, и игрок делает выбор. В конце отображается результат (выигрыш или проигрыш). ","Открыть <~>",false,"Cached >=", "https://xarn0.github.io/tz8/") 
       
</template>

<script>
export default {
	name: "works-small"
};
</script>

<style lang="scss" scoped>
.project__btn {
	align-self: start;
}
.worksSmall {
	&__content {
		display: flex;
		flex-wrap: wrap;
		gap: 10px;
	}
}
</style>
